#!/usr/bin/env bash
set -Eeuo pipefail

#Проверка работоспособности сервиса
if systemctl is-active --quiet lf-app.service; then
    echo "Сервис работает"
else
    echo "Сервис не работает"
    exit 1
fi
echo "----------------------------------------------------------------"
#Проверяем слушает ли порт
if ss -tlnp | grep -q 8080; then
    echo "OK: порт 8080 слушается"
else
    echo "ERROR: порт 8080 не слушается"
fi

echo "----------------------------------------------------------------"
# Проверяем успешен ли запрос
curl -f http://127.0.0.1:8080

echo "----------------------------------------------------------------"
# Проверяем от какого пользователя работает сервис
systemctl show lf-app.service | grep -E '^(User|Group)='
